josaragon/TM4C1294-automation-project/ft800_TIVA.c
/*
 * librerias.c
 *
 *  Created on: 30/10/2013
 *      Author: Manolo
 */


#include <stdbool.h>
#include <stdint.h>
#include "inc/hw_memmap.h"
#include "driverlib/gpio.h"
#include "driverlib/pin_map.h"
#include "driverlib/ssi.h"
#include "driverlib/sysctl.h"
#include "inc/hw_ints.h"
#include "driverlib/debug.h"
#include "driverlib/interrupt.h"
#include "driverlib/rom.h"
#include "driverlib/rom_map.h"
#include "FT800_TIVA.h"

extern int RELOJ;
/*
 * ======== Standard MSP430 includes ========
 */
//#include <msp430.h>

/*
 * ======== Grace related includes ========
 */
//#include <ti/mcu/msp430/Grace.h>

// =======================================================================
// Function Declarations
// =======================================================================
#define dword long
#define byte char

#define LEDOn()  ROM_GPIOPinWrite(CLP_D1_PORT, CLP_D1_PIN, CLP_D1_PIN);

#define LEDOff() ROM_GPIOPinWrite(CLP_D1_PORT, CLP_D1_PIN, 0)

extern char chipid ;                        // Holds value of Chip ID read from the FT800

extern unsigned long cmdBufferRd;         // Store the value read from the REG_CMD_READ register
extern unsigned long cmdBufferWr;         // Store the value read from the REG_CMD_WRITE register
extern unsigned int t;
// ############################################################################################################
// User Application - Initialization of MCU / FT800 / Display
// ############################################################################################################

extern int Fin_Rx;
extern char Buffer_Rx;
//extern unsigned long POSX, POSY, BufferXY;
extern unsigned int CMD_Offset;
extern unsigned long POSX, POSY, BufferXY;

uint32_t SSI_BASE,CS_PORT,CS_PIN,PD_PORT,PD_PIN;

// ############################################################################################################
// FT800 SPI Functions
// ############################################################################################################

// ############################################################################################################
// ############################################################################################################
// 										HAL functions
// ############################################################################################################
// ############################################################################################################
void HAL_Init_SPI(uint8_t Port, uint32_t RELOJ_ACT){
	//Inicializar el puerto SSI en función del BP usado, 1 ó 2
	switch (Port){
	case 1:

	    SysCtlPeripheralEnable(SYSCTL_PERIPH_SSI2);
	    SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOD);
	    SysCtlPeripheralEnable(SYSCTL_PERIPH_GPION);
	    //
	    //  pin PN3 es /CS
	    //
	    GPIOPinTypeGPIOOutput(GPIO_PORTN_BASE, GPIO_PIN_3);
	    CS_PORT=GPIO_PORTN_BASE;
	    CS_PIN=GPIO_PIN_3;

	    //
	    // pin PN2 es /PD
	    //
	    GPIOPinTypeGPIOOutput(GPIO_PORTN_BASE, GPIO_PIN_2);
	    PD_PORT=GPIO_PORTN_BASE;
	    PD_PIN=GPIO_PIN_2;

	    //
	    //  PD0 es SSI2 SSI2XDAT1
	    //
	    GPIOPinConfigure(GPIO_PD0_SSI2XDAT1);
	    GPIOPinTypeSSI(GPIO_PORTD_BASE, GPIO_PIN_0);

	    //
	    // PD1 es SSI2 SSI2XDAT0
	    //
	    GPIOPinConfigure(GPIO_PD1_SSI2XDAT0);
	    GPIOPinTypeSSI(GPIO_PORTD_BASE, GPIO_PIN_1);

	    //
	    // PD3 es SSI2 SSI2CLK
	    //
	    GPIOPinConfigure(GPIO_PD3_SSI2CLK);
	    GPIOPinTypeSSI(GPIO_PORTD_BASE, GPIO_PIN_3);
	    SSI_BASE=SSI2_BASE;
	    break;
	case 2:
		SysCtlPeripheralEnable(SYSCTL_PERIPH_SSI3);
		SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOQ);
		SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOP);
		//
		//  pin PQ1 es /CS
		//
		GPIOPinTypeGPIOOutput(GPIO_PORTQ_BASE, GPIO_PIN_1);
		CS_PORT=GPIO_PORTQ_BASE;
		CS_PIN=GPIO_PIN_1;

		//
		// pin PP3 es /PD
		//
		GPIOPinTypeGPIOOutput(GPIO_PORTP_BASE, GPIO_PIN_3);
		PD_PORT=GPIO_PORTP_BASE;
		PD_PIN=GPIO_PIN_3;

		//
		//  PQ3 es SSI3 SSI2XDAT1
		//
		GPIOPinConfigure(GPIO_PQ3_SSI3XDAT1);
		GPIOPinTypeSSI(GPIO_PORTQ_BASE, GPIO_PIN_3);

		//
		// PQ2 es SSI3 SSI3XDAT0
		//
		GPIOPinConfigure(GPIO_PQ2_SSI3XDAT0);
		GPIOPinTypeSSI(GPIO_PORTQ_BASE, GPIO_PIN_2);

		//
		// PQ0 es SSI3 SSI3CLK
		//
		GPIOPinConfigure(GPIO_PQ0_SSI3CLK);
		GPIOPinTypeSSI(GPIO_PORTQ_BASE, GPIO_PIN_0);
		SSI_BASE=SSI3_BASE;
		break;

	}
	SSIConfigSetExpClk(SSI_BASE, RELOJ_ACT, SSI_FRF_MOTO_MODE_0,
			SSI_MODE_MASTER, 1000000, 8);

	//
	// Enable the SSI module.
	//
	SSIEnable(SSI_BASE);




}


unsigned char HAL_SPI_ReadWrite(unsigned char data)
{
	uint32_t recibido;
    SSIDataPut(SSI_BASE, data);
    while(SSIBusy(SSI_BASE))
        {
        }
	asm(" NOP");
	asm(" NOP");asm(" NOP");asm(" NOP");asm(" NOP");asm(" NOP");asm(" NOP");

	SSIDataGet(SSI_BASE, &recibido);
	return (char)recibido;
}

// ============================================================================================================
// Puts Chip Select pin Low
// ============================================================================================================

void HAL_SPI_CSLow(void)
{
	ROM_GPIOPinWrite(CS_PORT, CS_PIN, 0);
}

// ============================================================================================================
// Puts Chip Select pin High
// ============================================================================================================

void HAL_SPI_CSHigh(void)
{
	ROM_GPIOPinWrite(CS_PORT, CS_PIN, CS_PIN);
}

// ============================================================================================================
// Puts FT800 Power_Down_# pin Low
// ============================================================================================================

void HAL_SPI_PDlow(void)
{
	ROM_GPIOPinWrite(PD_PORT, PD_PIN, 0);
}

// ============================================================================================================
// Puts FT800 Power_Down_# pin high
// ============================================================================================================

void HAL_SPI_PDhigh(void)
{
	ROM_GPIOPinWrite(PD_PORT, PD_PIN, PD_PIN);
}

// ============================================================================================================
// General Functions
// ============================================================================================================

#define MS 40000
void Delay(void)
{
    SysCtlDelay(200*MS);
}


// ============================================================================================================
// Send address of a register which is to be Written
// ============================================================================================================

// This function sends an address of a register which is to be written. It sets the MSBs to 10 to indicate a write
//
// Pass in:         00000000 xxxxxxxx yyyyyyyy zzzzzzzz     address as double word 32-bit value, only lower 3 bytes used
//
// Sends:           10xxxxxx                                bits 23 - 16 of the address, with bit 23/22 forced to 10
//                  yyyyyyyy                                bits 15 - 8  of the address
//                  zzzzzzzz                                bits 7 -  0  of the address
//
// Returns:         N/A

void FT800_SPI_SendAddressWR(dword Memory_Address)
{
    byte SPI_Writebyte = 0x00;

    // Write out the address. Only the lower 3 bytes are sent, with the most significant byte sent first
    SPI_Writebyte = ((Memory_Address & 0x00FF0000) >> 16);  // Mask off the first byte to send
    SPI_Writebyte = (SPI_Writebyte & 0xBF | 0x80);          // Since this is a write, the MSBs are forced to 10
    HAL_SPI_ReadWrite(SPI_Writebyte);                       // Call the low-level SPI routine for this MCU to send this byte                                                   //

    SPI_Writebyte = ((Memory_Address & 0x0000FF00) >> 8);   // Mask off the next byte to be sent
    HAL_SPI_ReadWrite(SPI_Writebyte);                       // Call the low-level SPI routine for this MCU to send this byte

