josaragon/TM4C1294-automation-project/ft800_TIVA.c
    // Chip Select High
    HAL_SPI_CSHigh();
}


// ============================================================================================================
// Host Command Dummy Read
// ============================================================================================================

// This function is specifically designed to send three 0x00 bytes to wake up the FT800
//
// Pass in:         N/A
//
// Sends:           [Chip Select Low]
//                  00000000         Dummy 0x00
//                  00000000         Dummy 0x00
//                  00000000         Dummy 0x00
//                  [Chip Select High]
//
// Returns:         N/A

void FT800_SPI_HostCommandDummyRead(void)
 {
 //   byte PortRead = 0x00;
  //  byte SPI_byte_Read = 0x00;
    byte SPI_Writebyte = 0x00;

    // Chip Select Low
    HAL_SPI_CSLow();

    // Read/Write
    SPI_Writebyte = 0x00;                                   // Sending dummy 00 byte
    HAL_SPI_ReadWrite(SPI_Writebyte);


    SPI_Writebyte = 0x00;                                   // Sending dummy 00 byte
    HAL_SPI_ReadWrite(SPI_Writebyte);


    SPI_Writebyte = 0x00;                                   // Sending dummy 00 byte
    HAL_SPI_ReadWrite(SPI_Writebyte);


    // Chip Select High
    HAL_SPI_CSHigh();
}

// ============================================================================================================
// Increment Command Offset
// ============================================================================================================

// This function is used when adding commands to the Command FIFO.
// After adding a command to the FIFO, this function will calculate the FIFO address offset where the next command
// should be written to.
// In general, the next command would be written to [previous offset plus the length of the last command] but due
// to the circular FIFO used, a command list may need to wrap round from an offset of 4095 to 0.
//
// Pass in:         N/A
//
// Sends:           [Chip Select Low]
//                  00000000         Dummy 0x00
//                  00000000         Dummy 0x00
//                  00000000         Dummy 0x00
//                  [Chip Select High]
//
// Returns:         N/A


unsigned int FT800_IncCMDOffset(unsigned int Current_Offset, byte Command_Size)
{
    unsigned int New_Offset;

    New_Offset = Current_Offset + Command_Size;

    if(New_Offset > 4095)
    {
        New_Offset = (New_Offset - 4096);
    }

    return New_Offset;
}




// ############################################################################################################
// ############################################################################################################
void ComEsperaFin(void){
do
{
    HAL_SPI_CSLow();                            //
    FT800_SPI_SendAddressRD(REG_CMD_WRITE);     //
    cmdBufferWr = FT800_SPI_Read32();           // Read the value of the REG_CMD_WRITE register
    HAL_SPI_CSHigh();                           //
    HAL_SPI_CSLow();                            //
    FT800_SPI_SendAddressRD(REG_CMD_READ);      //
    cmdBufferRd = FT800_SPI_Read32();           // Read the value of the REG_CMD_READ register
    HAL_SPI_CSHigh();                           //
} while(cmdBufferWr != cmdBufferRd);


// Check the actual value of the current WRITE register (pointer)

CMD_Offset = cmdBufferWr;
}


void EscribeRam32(unsigned long dato){
		HAL_SPI_CSLow();
        FT800_SPI_SendAddressWR(RAM_CMD + CMD_Offset);  // Writing to next available location in FIFO (FIFO base address + offset)
        FT800_SPI_Write32(dato);                  // Vertex 2F    01XXXXXX XXXXXXXX XYYYYYYY YYYYYYYY
        HAL_SPI_CSHigh();

        CMD_Offset = FT800_IncCMDOffset(CMD_Offset, 4); // Move the CMD Offset since we have just added 4 bytes to the FIFO
}

void EscribeRam16(unsigned int dato){
		HAL_SPI_CSLow();
        FT800_SPI_SendAddressWR(RAM_CMD + CMD_Offset);  // Writing to next available location in FIFO (FIFO base address + offset)
        FT800_SPI_Write16(dato);                  // Vertex 2F    01XXXXXX XXXXXXXX XYYYYYYY YYYYYYYY
        HAL_SPI_CSHigh();

        CMD_Offset = FT800_IncCMDOffset(CMD_Offset, 2); // Move the CMD Offset since we have just added 4 bytes to the FIFO
}

void EscribeRam8(char dato){
		HAL_SPI_CSLow();
        FT800_SPI_SendAddressWR(RAM_CMD + CMD_Offset);  // Writing to next available location in FIFO (FIFO base address + offset)
        FT800_SPI_Write8(dato);                  // Vertex 2F    01XXXXXX XXXXXXXX XYYYYYYY YYYYYYYY
        HAL_SPI_CSHigh();

        CMD_Offset = FT800_IncCMDOffset(CMD_Offset, 1); // Move the CMD Offset since we have just added 4 bytes to the FIFO
}



void EscribeRamTxt(char *cadena)
{
    while(*cadena) EscribeRam8(*cadena++);
    EscribeRam8(0);
}

void Comando(unsigned long COMM){
HAL_SPI_CSLow();                                //
FT800_SPI_SendAddressWR(RAM_CMD + CMD_Offset);  // Writing to next available location in FIFO (FIFO base address + offset)
FT800_SPI_Write32(COMM);                  // Write the DL_START command
HAL_SPI_CSHigh();                               //

CMD_Offset = FT800_IncCMDOffset(CMD_Offset, 4); // Move the CMD Offset since we have just added 4 bytes to the FIFO

}

void ComVertex2ff(int x,int y){
long coord;
		coord=x;
		coord=coord<<19;
		coord=coord+ (y<<4);
        HAL_SPI_CSLow();                                //
        FT800_SPI_SendAddressWR(RAM_CMD + CMD_Offset);  // Writing to next available location in FIFO (FIFO base address + offset)
        FT800_SPI_Write32(0x40000000+coord);                  // Vertex 2F    01XXXXXX XXXXXXXX XYYYYYYY YYYYYYYY
        HAL_SPI_CSHigh();                               //

        CMD_Offset = FT800_IncCMDOffset(CMD_Offset, 4); // Move the CMD Offset since we have just added 4 bytes to the FIFO
}

