josaragon/TM4C1294-automation-project/ft800_TIVA.c
// Display command ends the display list
HAL_SPI_CSLow();                                //
FT800_SPI_SendAddressWR(RAM_DL + 8);            // Write next entry in display list
FT800_SPI_Write32(0x00000000);                  // DISPLAY command 00000000 00000000 00000000 00000000
HAL_SPI_CSHigh();                               //

// Writing to the DL_SWAP register tells the Display Engine to render the new screen designed above.
HAL_SPI_CSLow();                                //
FT800_SPI_SendAddressWR(REG_DLSWAP);            // Writing to the DL_SWAP register...value 10 means render after last frame complete
FT800_SPI_Write32(0x00000002);                  // 00000000 00000000 00000000 000000SS  (SS bits define when render occurs)
HAL_SPI_CSHigh();                               // CS high



// =======================================================================
// Set the GPIO pins of the FT800 to enable the display now
// =======================================================================

// note: Refer to the GPIO section in the FT800 datasheet and also the connections to the GPIO
// used on the particular development module being used

// Bit 7 enables the LCD Display. It is set to output driving high
// Bit 1 enables the Audio Amplifier. It is set to output driving low to shut down the amplifier since audio not used here
// Bit 0 is unused but set to output driving high.

HAL_SPI_CSLow();                                // CS low                   Write REG_GPIO_DIR
FT800_SPI_SendAddressWR(REG_GPIO_DIR);          // Send the address
FT800_SPI_Write8(0x83);                         // Send the 8-bit value
HAL_SPI_CSHigh();                               // CS high

HAL_SPI_CSLow();                                // CS low                   Write REG_GPIO
FT800_SPI_SendAddressWR(REG_GPIO);              // Send the address
FT800_SPI_Write8(0x83);                         // Send the 8-bit value
HAL_SPI_CSHigh();                               // CS high

}


void Nueva_pantalla(int R, int G, int B){
    long color;
        color=R;
        color=color<<8;
        color+=G;
        color=color<<8;
        color+= B;

    ComEsperaFin();
    Comando(CMD_DLSTART);
 	Comando(0x02000000+color);  // Clear Color RGB   00000010 BBBBBBBB GGGGGGGG RRRRRRRR  (B/G/R = Colour values)
 	Comando(0x26000007);                            // Clear 00100110 -------- -------- -----CST  (C/S/T define which parameters to clear))
}

void Lee_pantalla(void){
            HAL_SPI_CSLow();                            	//
            FT800_SPI_SendAddressRD(REG_TOUCH_SCREEN_XY);   //
            BufferXY = FT800_SPI_Read32();           // Lee valor pantalla tactil
            HAL_SPI_CSHigh();
            POSX=(BufferXY&0xffff0000)>>16;
            POSY=BufferXY&0x0000FFFF;
}

unsigned long Lee_Reg(unsigned long dir){
	unsigned long Buff_temp;
		HAL_SPI_CSLow();                       	//
        FT800_SPI_SendAddressRD(dir);   //
        Buff_temp = FT800_SPI_Read32();           // Lee valor
        HAL_SPI_CSHigh();
return(Buff_temp);
}

void Esc_Reg(unsigned long dir, unsigned long valor){
	HAL_SPI_CSLow();
        FT800_SPI_SendAddressWR(dir);
        FT800_SPI_Write32(valor);
        HAL_SPI_CSHigh();
}


void ComScrollbar(int x, int y, int w, int h, int ops, int val, int size, int range)
{
		EscribeRam32(CMD_SCROLLBAR);
	    EscribeRam16(x);
		EscribeRam16(y);
	    EscribeRam16(w);
		EscribeRam16(h);
		EscribeRam16(ops);
		EscribeRam16(val);
		EscribeRam16(size);
		EscribeRam16(range);

}

void ComFgcolor(int R, int G, int B){
	long color;
		color=R;
		color=color<<8;
		color+=G;
		color=color<<8;
		color+= B;

	EscribeRam32 (CMD_FGCOLOR);
	EscribeRam32 (color);

}


void ComButton(int x, int y, int w, int h, int font, int ops, char *cadena)
{
		EscribeRam32(CMD_BUTTON);
        EscribeRam16(x);
        EscribeRam16(y);
        EscribeRam16(w);
        EscribeRam16(h);
        EscribeRam16(font);
        EscribeRam16(ops);
        while(*cadena) EscribeRam8(*cadena++);
        EscribeRam8(0);

        PadFIFO();

}

void Espera_pant(void)
{
	do{
		Lee_pantalla();

	}while(POSY==0x8000);
	Delay();
	do{
			Lee_pantalla();

		}while(POSY!=0x8000);

}

void ComLineWidth(int width){
    Comando(CMD_LINEWIDTH+width*16);
}

void ComPointSize(int size){
Comando(CMD_POINTSIZE+size*16);
}

void Calibra_touch(void){
ComEsperaFin();
	Comando(CMD_DLSTART);
	Comando(0x02f7f7f7);  // Clear Color RGB   00000010 BBBBBBBB GGGGGGGG RRRRRRRR  (B/G/R = Colour values)
	Comando(0x26000007);                            // Clear 00100110 -------- -------- -----CST  (C/S/T define which parameters to clear))
	ComColor(0x00,0x00,0x00);

        ComTXT(60,30,27,0,"Pulsa en el punto");
        EscribeRam32(CMD_CALIBRATE);

        Dibuja();
    	SysCtlDelay(RELOJ/6);

        //espera(500);
        ComEsperaFin();
       	Comando(CMD_DLSTART);
       	Comando(0x02ffff00);  // Clear Color RGB   00000010 BBBBBBBB GGGGGGGG RRRRRRRR  (B/G/R = Colour values)
       	Comando(0x26000007);                            // Clear 00100110 -------- -------- -----CST  (C/S/T define which parameters to clear))
        Dibuja();
}

void ComGradient(int x0,int y0, long color0, int x1, int y1, int color1){
	EscribeRam32(CMD_GRADIENT);
	EscribeRam16(x0);
	EscribeRam16(y0);
	EscribeRam32(color0);
	EscribeRam16(x1);
	EscribeRam16(y1);
	EscribeRam32(color1);

}

void VolNota(unsigned char volumen){
	HAL_SPI_CSLow();
		        FT800_SPI_SendAddressWR(REG_VOL_SOUND);
		        FT800_SPI_Write8(volumen);
		        HAL_SPI_CSHigh();

}
void TocaNota( int instr, int nota)
{
//	char comando;
	HAL_SPI_CSLow();
	        FT800_SPI_SendAddressWR(REG_SOUND);
	        FT800_SPI_Write16(instr+(nota<<8));
	        HAL_SPI_CSHigh();

	        HAL_SPI_CSLow();
	        	        FT800_SPI_SendAddressWR(REG_PLAY);
	        	        FT800_SPI_Write8(1);
	        	        HAL_SPI_CSHigh();

	}

void FinNota(void)
{
//	char comando;
	HAL_SPI_CSLow();
	FT800_SPI_SendAddressWR(REG_SOUND);
	FT800_SPI_Write16(0x0000);
	HAL_SPI_CSHigh();

	HAL_SPI_CSLow();
	FT800_SPI_SendAddressWR(REG_PLAY);
	FT800_SPI_Write8(1);
	HAL_SPI_CSHigh();



}


void Fadeout(void)
{
   int i;

	for (i = 100; i >= 0; i -= 3)
	{
        HAL_SPI_CSLow();
        	        FT800_SPI_SendAddressWR(REG_PWM_DUTY);
       	        FT800_SPI_Write8(i);
    	        HAL_SPI_CSHigh();


    	    	SysCtlDelay(RELOJ/1500);


	}
}

/* API to perform display fadein effect by changing the display PWM from 0 till 100 and finally 128 */
void Fadein()
{
	int i;

	for (i = 0; i <=100 ; i += 3)
	{
		 HAL_SPI_CSLow();
		        	    FT800_SPI_SendAddressWR(REG_PWM_DUTY);
		       	        FT800_SPI_Write8(i);
		    	        HAL_SPI_CSHigh();
		    	    	SysCtlDelay(RELOJ/1500);

		       	        //espera(2);
	}
	i = 128;
	 HAL_SPI_CSLow();
		        	    FT800_SPI_SendAddressWR(REG_PWM_DUTY);
		       	        FT800_SPI_Write8(i);
		    	        HAL_SPI_CSHigh();

}
